In [2]:
import numpy as np
import pandas as pd

In [3]:
s=pd.Series([1, 2, 3,np.nan, 4, 5])

In [4]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [5]:
dates=pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.379282 -0.291660  1.437453  0.376647
2013-01-02 -0.779999  0.886112 -1.283790 -0.118546
2013-01-03 -0.311303 -1.235283 -0.836765  0.016613
2013-01-04  0.858195 -0.416034  0.798508  0.217856
2013-01-05 -1.346730 -0.927902 -0.584132  0.383499
2013-01-06 -1.069045 -0.319042 -1.449326 -1.201138

In [9]:
df2=pd.DataFrame({'A':1.,'B':pd.Timestamp('20130102'),'C':pd.Series(1,index=list(range(4)),dtype='float32'),'D':np.array([3]*4,dtype='int32'),'E':pd.Categorical(["test","train","test","train"]),'F':'foo'})

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.504694 -0.383968 -0.319676 -0.054178
std    0.776390  0.727663  1.173097  0.595961
min   -1.346730 -1.235283 -1.449326 -1.201138
25%   -0.996784 -0.799935 -1.172034 -0.084756
50%   -0.579640 -0.367538 -0.710449  0.117235
75%   -0.328297 -0.298505  0.452848  0.336949
max    0.858195  0.886112  1.437453  0.383499

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.379282   -0.779999   -0.311303    0.858195   -1.346730   -1.069045
B   -0.291660    0.886112   -1.235283   -0.416034   -0.927902   -0.319042
C    1.437453   -1.283790   -0.836765    0.798508   -0.584132   -1.449326
D    0.376647   -0.118546    0.016613    0.217856    0.383499   -1.201138

In [18]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.376647  1.437453 -0.291660 -0.379282
2013-01-02 -0.118546 -1.283790  0.886112 -0.779999
2013-01-03  0.016613 -0.836765 -1.235283 -0.311303
2013-01-04  0.217856  0.798508 -0.416034  0.858195
2013-01-05  0.383499 -0.584132 -0.927902 -1.346730
2013-01-06 -1.201138 -1.449326 -0.319042 -1.069045

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.311303 -1.235283 -0.836765  0.016613
2013-01-05 -1.346730 -0.927902 -0.584132  0.383499
2013-01-04  0.858195 -0.416034  0.798508  0.217856
2013-01-06 -1.069045 -0.319042 -1.449326 -1.201138
2013-01-01 -0.379282 -0.291660  1.437453  0.376647
2013-01-02 -0.779999  0.886112 -1.283790 -0.118546

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.779999  0.886112 -1.283790 -0.118546
2013-01-03 -0.311303 -1.235283 -0.836765  0.016613
2013-01-04  0.858195 -0.416034  0.798508  0.217856

In [23]:
df.loc[dates[0]]

A   -0.379282
B   -0.291660
C    1.437453
D    0.376647
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.379282 -0.291660
2013-01-02 -0.779999  0.886112
2013-01-03 -0.311303 -1.235283
2013-01-04  0.858195 -0.416034
2013-01-05 -1.346730 -0.927902
2013-01-06 -1.069045 -0.319042

In [25]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.779999  0.886112
2013-01-03 -0.311303 -1.235283
2013-01-04  0.858195 -0.416034

In [26]:
df.loc[dates[0]]

A   -0.379282
B   -0.291660
C    1.437453
D    0.376647
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.379282 -0.291660
2013-01-02 -0.779999  0.886112
2013-01-03 -0.311303 -1.235283
2013-01-04  0.858195 -0.416034
2013-01-05 -1.346730 -0.927902
2013-01-06 -1.069045 -0.319042

In [29]:
df.loc["20130101":"20130103",['A','B']]

                   A         B
2013-01-01 -0.379282 -0.291660
2013-01-02 -0.779999  0.886112
2013-01-03 -0.311303 -1.235283

In [30]:
df.loc[dates[0],'A']

np.float64(-0.37928186229327365)

In [31]:
df.at[dates[0],'A']

np.float64(-0.37928186229327365)

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.858195 -0.416034
2013-01-05 -1.346730 -0.927902

In [33]:
df.iloc[3]

A    0.858195
B   -0.416034
C    0.798508
D    0.217856
Name: 2013-01-04 00:00:00, dtype: float64